'use client'

import EditTable from '@/components/common/EditTable';
import { Button } from '@/components/ui/button';

const payrollManageCodeColumns = [
  { type: 'text', title: '지급/공제' },
  { type: 'text', title: '항목명' },
  { type: 'text', title: '금액' },
  { type: 'text', title: '시작년월' },
  { type: 'text', title: '종료년월' },
  { type: 'text', title: '비고' },
]

const payrollManageCodeRows = [
  {
    '지급/공제': '지급',
    '항목명': '기본급',
    '금액': '4,700,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '지급',
    '항목명': '연차수당',
    '금액': '0',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '지급',
    '항목명': '야간수당',
    '금액': '0',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '지급',
    '항목명': '식대',
    '금액': '100,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '지급',
    '항목명': '차량유지비',
    '금액': '200,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '지급',
    '항목명': '직급수당',
    '금액': '300,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동생성',
  },
  
  {
    '지급/공제': '공제',
    '항목명': '국민연금',
    '금액': '211,500',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
  
  {
    '지급/공제': '공제',
    '항목명': '건강보험',
    '금액': '168,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
  {
    '지급/공제': '공제',
    '항목명': '건강보험',
    '금액': '168,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
  {
    '지급/공제': '공제',
    '항목명': '건강보험',
    '금액': '168,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
  {
    '지급/공제': '공제',
    '항목명': '건강보험',
    '금액': '168,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
  {
    '지급/공제': '공제',
    '항목명': '건강보험',
    '금액': '168,000',
    '시작년월': '201601',
    '종료년월': '999912',
    '비고': '자동계산',
  },
]

export default function PayrollManageCode() {
  return (
    <div>
      <EditTable
        columns={payrollManageCodeColumns}
        rows={payrollManageCodeRows}
        buttonRender={() => (
          <>
            <Button>저장</Button>
          </>
        )}
      />
    </div>
  )
}